app/controllers/cheerups_controller.rb

  def index
    @cheerups = Cheerup.all
---
SELECT "cheerups".* FROM "cheerups"

  def new
    @cheerup = Cheerup.new

    @user = User.find(session[:user_id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]