app/controllers/users_controller.rb

  def index
    @users = User.all
    @current_user = User.find_by_id(session[:current_user_id])
---
SELECT "users".* FROM "users"
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]

  def create
    user = User.new(user_params)
    if user.save
---
INSERT INTO "users" ("image_url", "name", "email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"